Tekla Open API Reference for Tekla Structures 2025
RebarLegSurfaceObject.AdditionalOffset Property
 Gets or sets the user defined offset of the rebar legs from the leg surface object.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double AdditionalOffset { get; set; }
Public Property AdditionalOffset As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RebarLegSurfaceObject Class
Tekla.Structures.Model Namespace